Repository: Zaheer-iqbal/MSS
Catalog: lib/l10n/app_*.arb
Languages: ur

# appTitle
source: MSS
ur: ایم ایس ایس

source: Hello
ur: ہیلو

source: My Attendance
ur: میری حاضری

source: Present
ur: حاضر

source: Absent
ur: غیر حاضر

source: Not Marked
ur: نہیں لگائی گئی

source: Mark Present
ur: حاضری لگائیں

source: Mark Absent
ur: غیر حاضری لگائیں

# attendanceMarkedSuccess
source: Attendance marked successfully!
ur: حاضری کامیابی سے لگا دی گئی ہے!

source: Quick Actions
ur: فوری اقدامات

source: Attendance
ur: حاضری

source: Students
ur: طلبہ

source: Results
ur: نتائج

source: Assignments
ur: اسائنمنٹس

source: My Teaching Calendar
ur: میرا کالینڈر

source: Daily Schedule
ur: روزانہ کا شیڈول

source: No Class Scheduled
ur: کوئی کلاس شیڈول نہیں ہے

source: Enjoy your day!
ur: اپنا دن انجوائے کریں!

source: Performance Analytics
ur: کارکردگی کا تجزیہ

source: Attendance Rate
ur: حاضری کی شرح

source: Assignments Completed
ur: مکمل کی گئی اسائنمنٹس

source: Quiz Scores (Avg)
ur: کوئز اسکورز (اوسط)

source: Ready to Start?
ur: شروع کرنے کے لیے تیار ہیں؟

# noClassesAssigned
source: You haven't been assigned any classes yet. Once the Head Teacher assigns you classes, you'll see your students and schedule here.
ur: آپ کو ابھی تک کوئی کلاس تفویض نہیں کی گئی ہے۔ جیسے ہی ہیڈ ٹیچر آپ کو کلاس تفویض کریں گے، آپ یہاں اپنے طلبہ اور شیڈول دیکھ سکیں گے۔

source: Refresh Dashboard
ur: ڈیش بورڈ ریفریش کریں

source: School Staff
ur: سکول سٹاف

# searchStaffHint
source: Search staff by name...
ur: نام سے سٹاف تلاش کریں...

# noStaffFound
source: No staff members found
ur: کوئی سٹاف نہیں ملا

# noMatchingStaffFound
source: No matching staff members found
ur: نام سے کوئی سٹاف نہیں ملا

# classesAssigned
source: {count} Classes Assigned
ur: {count} کلاسیں تفویض کی گئی ہیں

source: School Overview
ur: سکول کا جائزہ

source: Total Students
ur: کل طلبہ

source: Total Staff
ur: کل سٹاف

source: Fee Status
ur: فیس کی صورتحال

source: Rating
ur: درجہ بندی

source: Administrative Tools
ur: انتظامی ٹولز

source: Staff
ur: سٹاف

source: Admissions
ur: داخلے

source: Fees
ur: فیس

source: Events
ur: پروگرامز

source: Reports
ur: رپورٹس

source: Settings
ur: سیٹنگز

source: Head Teacher
ur: ہیڈ ٹیچر

source: Select Your Role
ur: اپنا کردار منتخب کریں

# continueAs
source: Continue as {role}
ur: بطور {role} جاری رکھیں

source: School
ur: سکول

source: Teacher
ur: ٹیچر

source: Parent
ur: والدین

source: Student
ur: طالب علم

# appAppName
source: My Smart School
ur: میرا سمارٹ سکول

# authWelcomeSub
source: Create an account or login to continue
ur: جاری رکھنے کے لیے اکاؤنٹ بنائیں یا لاگ ان کریں

source: School Admin
ur: سکول ایڈمن

# loginExisting
source: Login to Existing Account
ur: موجودہ اکاؤنٹ میں لاگ ان کریں
